//
//  Description.swift
//  UIKitDZ
//
//  Created by Анастасия Козлова on 26.09.2022.
//

import UIKit
/// Description: хранит описание домов и кроватей
/// - descriptionArray: Массив с описанием домов
struct Description {
    
    let descriptionHouseArray = [
    """
    Cовременная комфортабельная загородная резиденция, располагающая всем необходимым для работы и отдыха.
    Два этажа сообщаются между собой лестничными пролетами и лифтом, кровля эксплуатируемая.
    Планировка первого этажа условно разделена на две половины.
    Одно крыло занимает бассейн с хаммамом, душевыми, сауной, тренажерным залом.
""",
    """
    Проект двухэтажного дома в стиле hi-tech создавался для большой гостеприимной семьи.
    Площадь дома разбита на четыре спальни, дополненные гардеробными и санузлами,
несколько кабинетов, бассейн, сауну, хамам, парикмахерскую, комнаты персонала, тренажерный зал,
а также две просторные террасы.
    На территории плоской крыши в летний период можно организовать солярий на открытом воздухе.
""",
    
    """
    Облик этого загородного дома в стиле кубизм предельно прост, лаконичен и нейтрален.
    Главной архитектурной особенностью является панорамное остекление – прием,
    который задает настроение и фасаду, и интерьеру:
    визуально жилое пространство становится не только светлее, но и больше, масштабнее.
    Особое место в доме занимает зона отдыха – бассейн с панорамным остеклением и сауна.

Просторная гостиная одинаково хорошо подходит и для уютных семейных вечеров,
 и для шумных праздников и встреч с друзьями.
"""
    ]
    
    let descriptionBedArray = ["""
Двуспальная кровать Neo – ультрасовременная модель в минималистском стиле,
cозданная искусными мастерами знаменитой немецкой фабрики Hulsta
с использованием материалов исключительного качества. Тонкое,
но прочное основание в виде двух скобообразных ножек изготовлено
из полированного металла и представлено в нескольких вариантах цветового исполнения.
Деревянные панели каркаса, изголовья и изножья также представлены
 в нескольких вариантах отделки: белый или серый лак, натуральный дуб или сердцевинный орех.
Кровать может быть дополнена прикроватными тумбами из одноименной коллекции,
составив единую гармоничную композицию для комфортного сна и отдыха.
""",
"""
Кровать с L-образной рамой выполнена с основой из древесины.
Мягкость изголовья и основания обеспечивает полиуретан, а для обивки использован текстиль.
Рамка в форме буквы L прикреплена к стене и поддерживает основание изделия
и две массивные подушки изголовья. По обеим сторонам от матраса есть пространство,
 выполняющее роль ночных столиков. На выбор там можно разместить подносы,
полки, сундуки или ящики. Деревянные детали могут быть в виде крашеного дуба или лака.
 Кровать представлена в нескольких размерах.
""",
"""
Двуспальная кровать – элегантная модель в современном минималистском стиле
 с легким налетом mid-century modernism,
которая станет главным визуальным акцентом в спальне и излюбленным
 местом отдыха после долгого дня.
Каркас кровати изготовлен из натуральной древесины и полностью скрыт под обивкой.
Тонкие, но прочные ножки основания кровати созданы с использованием полированного металла.
В качестве внутреннего наполнения нижней части высокого изголовья
используется формованный пенополиуретан исключительного качества,
который сверху обит тканью с полосатым орнаментальным декором.
Верхняя часть изголовья, а также рама кровати обиты натуральной кожей
 насыщенного терракотового оттенка.
"""
    ]
    
}
