//
//  Description.swift
//  UIKitDZ
//
//  Created by Анастасия Козлова on 26.09.2022.
//

import UIKit
/// Description - хранит описание домов
struct Description {
    
    let descriptionArray = [
    """
    Cовременная комфортабельная загородная резиденция, располагающая всем необходимым для работы и отдыха.
    Два этажа сообщаются между собой лестничными пролетами и лифтом, кровля эксплуатируемая.
    Планировка первого этажа условно разделена на две половины.
    Одно крыло занимает бассейн с хаммамом, душевыми, сауной, тренажерным залом.
""",
    """
    Проект двухэтажного дома в стиле hi-tech создавался для большой гостеприимной семьи.
    Площадь дома разбита на четыре спальни, дополненные гардеробными и санузлами,
несколько кабинетов, бассейн, сауну, хамам, парикмахерскую, комнаты персонала, тренажерный зал,
а также две просторные террасы.
    На территории плоской крыши в летний период можно организовать солярий на открытом воздухе.
""",
    
    """
    Облик этого загородного дома в стиле кубизм предельно прост, лаконичен и нейтрален.
    Главной архитектурной особенностью является панорамное остекление – прием,
    который задает настроение и фасаду, и интерьеру:
    визуально жилое пространство становится не только светлее, но и больше, масштабнее.
    Особое место в доме занимает зона отдыха – бассейн с панорамным остеклением и сауна.

Просторная гостиная одинаково хорошо подходит и для уютных семейных вечеров,
 и для шумных праздников и встреч с друзьями.
"""
    ]
}
